CASES/FW/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    FW01V3.stl { type triSurfaceMesh; name FW01V3; }
    nearBody { type searchableBox; min (-0.148 -0.01 0.167); max (0.888 0.381 1.014); }
    wakeBox { type searchableBox; min (-0.148 -0.01 -2.132); max (0.888 0.381 0.288); }
}

castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      20000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        { file "FW01V3.eMesh"; level 6; }
    );

    refinementSurfaces
    {
        FW01V3 { level (4 5); patchInfo { type wall; } }
    }

    resolveFeatureAngle 20;

    refinementRegions
    {
        nearBody { mode inside; levels ((1e15 3)); }
        wakeBox { mode inside; levels ((1e15 2)); }
    }

    locationInMesh (1.2500 2.2500 1.0500);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        5;
    tolerance           2.0;
    nSolveIter          200;
    nRelaxIter          8;
    nFeatureSnapIter    15;
    implicitFeatureSnap true;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    layers
    {
        "FW01V3" { nSurfaceLayers 5; }
        "ground" { nSurfaceLayers 5; }
    }
    expansionRatio          1.2;
    firstLayerThickness     0.3;
    minThickness            0.05;
    nGrow                   0;
    featureAngle            170;
    slipFeatureAngle        30;
    maxFaceThicknessRatio   0.5;
    nSmoothSurfaceNormals   3;
    nSmoothThickness        10;
    nSmoothNormals          3;
    nRelaxIter              10;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
    maxAlignedCells         200000;
    minMedialAxisAngle      90;
    maxThicknessToMedialRatio 0.3;
    nMedialAxisIter         10;
    nSmoothDisplacement     0;
    detectExtrusionIsland   true;
    nRelaxedIter            20;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        maxNonOrtho     75;
        maxBoundarySkewness 25;
        maxInternalSkewness 5;
        maxConcave      85;
        minVol          1e-13;
        minTetQuality   1e-30;
        minArea         -1;
        minTwist        0.001;
        minDeterminant  0.0005;
        minFaceWeight   0.02;
        minVolRatio     0.005;
        minTriangleTwist -1;
    }
}

writeFlags ( scalarLevels layerSets layerFields );
mergeTolerance 1e-6;


// ************************************************************************* //
