CASES/FW/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -16.67);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -16.67);
    }
    outlet
    {
        type            zeroGradient;
    }
    "FW01V3"
    {
        type            noSlip;
    }
    ground
    {
        type            fixedValue;
        value           uniform (0 0 -16.67);
    }
    farField
    {
        type            slip;
    }
    symmetry
    {
        type            symmetry;
    }
}


// ************************************************************************* //
